/********************************************************************************
* 文件名称 ：BS_SF_DEMO.c
* 作 者：Bossay IoT 开发组
* 版 本：V1.0
* 编写日期 ：2019-11-01
* 功 能：SF_Demo驱动
*********************************************************************************
* 说 明 ：本案例配套Bossay IoT Box开发板使用
* 网 站 ：edu.ibossay.com
* 电 话 ：4006916913 
*********************************************************************************/

#include "DEMO.h"
#include "SmokeSensor.h"
#include "Actuators.h"
#include "stm32l4xx.h"
#include "stm32l4xx_it.h"
#include "gpio.h"
#include "adc.h"



/***************************************************************
* 函数名称: Init_BS_SF_DEMO
* 说    明: 初始化BS_SF_DEMO
* 参    数: 无
* 返 回 值: 无
***************************************************************/
void Init_BS_SF_DEMO(void)
{
	MX_ADC1_Init();
	Init_Beep();
	Init_Light();
	MX_TIM1_Init();
}



