/********************************************************************************
* 文件名称 ：LED.h
* 作 者：Bossay IoT 开发组
* 版 本：V1.0
* 编写日期 ：2019-11-01
* 功 能：IoTBox LIGHT驱动
*********************************************************************************
* 说 明 ：本案例配套Bossay IoT Box开发板使用
* 网 站 ：edu.ibossay.com
* 电 话 ：4006916913 
*********************************************************************************/
#ifndef __LIGHT_H__
#define __LIGHT_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/***************************************************************
* 名		称: GasStatus_ENUM
* 说    明：枚举状态结构体
***************************************************************/
static enum
{
	OFF = 0,
	ON
}Light_Status_ENUM;



void Init_Light(void);
void IoTBox_Light_StatusSet(Light_Status_ENUM Light_status);
void Light_blink(void);

#endif

