/********************************************************************************
* 文件名称 ：SHT30.h
* 作 者：Bossay IoT 开发组
* 版 本：V1.0
* 编写日期 ：2019-11-01
* 功 能：IoTBox 温湿度传感器驱动
*********************************************************************************
* 说 明 ：本案例配套Bossay IoT Box开发板使用
* 网 站 ：edu.ibossay.com
* 电 话 ：4006916913 
*********************************************************************************/
#ifndef __SHT30_H__
#define __SHR30_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* 寄存器宏定义 --------------------------------------------------------------------*/
#define I2C_OWN_ADDRESS                            0x0A
#define SHT30_Addr 0x44


/* 温湿度传感器数据类型定义 ------------------------------------------------------------*/
typedef struct
{							
	float    Humidity;        //湿度
    float    Temperature;     //温度
} IoTBox_HT_Data_TypeDef;


extern IoTBox_HT_Data_TypeDef IoTBox_HT_Data;
void Init_SHT30(void);
void IoTBox_Hum_Temp_Read_Data(void);

#endif

